W6D3/AJAXTwitter/app/controllers/tweets_controller.rb

  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save
---
INSERT INTO "tweets" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "blasphemy"], ["created_at", "2017-06-07 16:04:03.723015"], ["updated_at", "2017-06-07 16:04:03.723015"], ["user_id", 8]]